Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Prefabricated swimming pools accessory to a Group R-3 occupancy that are less than 24 inches (610 mm) deep, are not greater than 5,000 gallons (18 925 L) and are installed entirely above ground.
fr_ca: Piscines préfabriquées accessoires à un usage du groupe R-3, d’une profondeur inférieure à 24 po (610 mm), d’une capacité maximale de 5 000 gallons (18 925 L) et installées entièrement hors sol.

source: Press boxes in a building, room or space used for assembly purposes shall be on an accessible route.
fr_ca: Les loges de presse dans un bâtiment, une pièce ou une aire utilisée à des fins de réunions doivent être situées sur un itinéraire accessible.

source: Prior to construction of a new building requiring a fire alarm system on a multiple-building college or university campus having a cumulative building occupant load of 1,000 or more, a mass notification risk analysis shall be conducted in accordance with NFPA 72.
fr_ca: Avant la construction d’un bâtiment neuf nécessitant un système d’alarme d’incendie sur un campus collégial ou universitaire comportant plusieurs bâtiments et dont la charge d’occupants cumulative est d’au moins 1 000 personnes, une analyse des risques liés à la notification de masse doit être effectuée conformément à la norme NFPA 72.

source: Privacy at water closets and urinals shall be provided in accordance with Sections 1210.3.1 and 1210.3.2.
fr_ca: L'intimité des cabines de toilette et des urinoirs doit être assurée selon les sections 1210.3.1 et 1210.3.2.

source: Privacy provided by walls, curtains or partitions enclosing the compartment.
fr_ca: Intimité assurée par des murs, des rideaux ou des cloisons entourant le compartiment.

source: Privacy provided by walls, curtains or partitions.
fr_ca: Intimité assurée par des murs, des rideaux ou des cloisons.

source: Private garages or carports that contain required accessible parking.
fr_ca: Garages privés ou abris d'auto qui contiennent le stationnement accessible requis.

source: Private residence elevators shall comply with Section 409 and ASME A17.1/CSA B44 listed in Section 106.2.8.
fr_ca: Les ascenseurs desservant une résidence privée doivent être conformes à la section 409 et à la norme ASME A17.1/CSA B44 mentionnée à la section 106.2.8.

source: Projections into the required ramp and landing width are prohibited.
fr_ca: Les éléments en saillie dans la largeur requise de la rampe et du palier sont interdits.

source: Protection by a draft curtain and closely spaced sprinklers in accordance with NFPA 13 shall be permitted where the area of the vertical opening between stories does not exceed twice the horizontal projected area of the escalator.
fr_ca: La protection au moyen d’un écran de cantonnement des fumées et d’extincteurs automatiques rapprochés, conformément à la norme NFPA 13, est autorisée lorsque la superficie de l’ouverture verticale entre les étages ne dépasse pas deux fois la superficie horizontale projetée de l’escalier mécanique.

source: Protection of joints and penetrations in fire-resistance-rated assemblies, smoke barriers and smoke partitions shall not be concealed from view until inspected and approved.
fr_ca: La protection des joints et des pénétrations dans les ensembles ayant une résistance au feu, les barrières coupe-fumée et les cloisons coupe-fumée ne doit pas être dissimulée avant d’avoir été inspectée et approuvée.

source: Protection of the vertical opening by approved shutters at every penetrated floor shall be permitted in accordance with this section.
fr_ca: La protection de l'ouverture verticale par des volets approuvés à chaque étage traversé est autorisée conformément à la présente section.

source: Public restrooms shall be visually screened from outside entry or exit doorways to ensure user privacy within the restroom.
fr_ca: Les toilettes publiques doivent être visuellement isolées des ouvertures de porte d'entrée ou de sortie extérieures pour assurer l'intimité des utilisateurs à l'intérieur de la toilette.

source: Quick-response or residential automatic sprinklers shall be installed in accordance with Section 903.3.2.
fr_ca: Les extincteurs automatiques à réponse rapide ou résidentiels doivent être installés conformément à la section 903.3.2.

source: REQUIREMENTS
fr_ca: EXIGENCES

source: Radio and television transmitting stations: The provisions of this code shall not apply to electrical equipment used for radio and television transmissions, but do apply to equipment and wiring for a power supply and the installations of towers and antennas.
fr_ca: Stations émettrices de radio et de télévision : Les dispositions du présent code ne s’appliquent pas aux équipements électriques utilisés pour les transmissions radio et télévisuelles, mais s’appliquent aux équipements et au câblage destinés à l’alimentation électrique ainsi qu’à l’installation de tours et d’antennes.

source: Raised areas used primarily for purposes of security, life safety or fire safety including, but not limited to, observation galleries, prison guard towers, fire towers or lifeguard stands are not required to comply with this chapter.
fr_ca: Les zones surélevées utilisées principalement à des fins de sécurité, de sécurité des personnes ou de sécurité incendie, notamment, sans toutefois s’y limiter, les galeries d’observation, les miradors de gardiens de prison, les tours de guet contre les incendies ou les postes de sauveteurs, ne sont pas tenues d’être conformes au présent chapitre.

source: Raised characters for elevator car controls shall not be required to comply with Section 703.3.10.
fr_ca: Les caractères en relief pour les commandes de cabine d'ascenseur ne sont pas tenus de se conformer à la section 703.3.10.

source: Raised characters shall be 2 inches (51 mm) minimum in height.
fr_ca: Les caractères en relief doivent avoir une hauteur minimale de 2 po [51 mm].

source: Raised characters shall be raised 1/32 inch (0.8 mm) minimum above their background.
fr_ca: Les caractères en relief doivent être surélevés d'au moins 1/32 po [0,8 mm] au-dessus de leur fond.

source: Raised or lowered areas, or portions of areas, in places of religious worship that are less than 300 square feet (30 m2) in area and located 7 inches (178 mm) or more above or below the finished floor and used primarily for the performance of religious ceremonies are not required to comply with this chapter.
fr_ca: Les zones surélevées ou abaissées, ou les parties de ces zones, dans les lieux de culte, dont la superficie est inférieure à 300 pi² (30 m²), qui sont situées à 7 po (178 mm) ou plus au-dessus ou au-dessous du plancher fini et qui sont utilisées principalement pour la tenue de cérémonies religieuses, ne sont pas tenues d’être conformes au présent chapitre.

source: Ramp handrails shall extend horizontally above the landing 12 inches (305 mm) minimum beyond the top and bottom of ramp runs.
fr_ca: Les rampes doivent s'étendre horizontalement au-dessus du palier à au moins 12 po [305 mm] au-delà du haut et du bas des rampes.

source: Ramp runs shall have a running slope greater than 1:20 and not steeper than 1:12.
fr_ca: Les rampes doivent avoir une pente supérieure à 1:20 et d'au plus 1:12.

source: Ramp runs with a rise greater than 6 inches (150 mm) shall have handrails complying with Section 505.
fr_ca: Les tronçons de rampe dont la hauteur est supérieure à 6 po [150 mm] doivent être munis de rampes conformes à la section 505.

source: Ramp widths shall not be less than the platform opening they serve.
fr_ca: La largeur des rampes ne doit pas être inférieure à l'ouverture de la plateforme qu'elles desservent.

source: Ramped aisles having a slope exceeding one unit vertical in 15 units horizontal (6.7-percent slope) and stepped aisles shall be provided with handrails in compliance with Section 1014 located either at one or both sides of the aisle or within the aisle width.
fr_ca: Les allées en pente dont la pente est supérieure à 1 unité verticale sur 15 unités horizontales (pente de 6,7 %) et les allées à gradins doivent être munies de mains courantes conformes à la section 1014, situées sur un ou sur les deux côtés de l’allée ou à l’intérieur de sa largeur.

source: Ramped aisles shall comply with Sections 1030.14.1 through 1030.14.1.3.
fr_ca: Les allées en pente doivent être conformes aux sections 1030.14.1 à 1030.14.1.3.

source: Ramped aisles shall have edge protection in accordance with Sections 1012.10 and 1012.10.1.
fr_ca: Les allées en pente doivent être munies d'une protection de bord selon les sections 1012.10 et 1012.10.1.

source: Ramped aisles shall have landings in accordance with Sections 1012.6 through 1012.6.5.
fr_ca: Les allées en pente doivent comporter des paliers conformément aux sections 1012.6 à 1012.6.5.

source: Ramped aisles steeper than 1 in 10 in slope
fr_ca: Allées en pente dont la pente est supérieure à 1:10

source: Ramped aisles that serve as part of an accessible route in accordance with Sections 1009 and 1109.2 shall have a maximum slope of 1 unit vertical in 12 units horizontal (8-percent slope).
fr_ca: Les allées en pente qui font partie d’une voie accessible conformément aux sections 1009 et 1109.2 doivent avoir une pente maximale de 1 unité verticale sur 12 unités horizontales (pente de 8 %).

source: Ramps along accessible routes shall comply with Section 405.
fr_ca: Les rampes le long des parcours accessibles doivent être conformes à la section 405.

source: Ramps not subject to the exception to Section 405.5 shall be designed to maintain a 36-inch (915 mm) minimum clear width where handrails are installed.
fr_ca: Les rampes non soumises à l'exception à la section 405.5 doivent être conçues de manière à maintenir une largeur libre minimale de 36 po [915 mm] là où des rampes sont installées.

source: Ramps shall be built of materials consistent with the types permitted for the type of construction of the building, except that wood handrails shall be permitted for all types of construction.
fr_ca: Les rampes doivent être construites avec des matériaux conformes aux types de matériaux autorisés pour le type de construction du bâtiment, sauf que des mains courantes en bois sont autorisées pour tous les types de construction.

source: Ramps shall comply with Section 405.
fr_ca: Les rampes doivent être conformes à la section 405.

source: Ramps shall have landings at the bottom and top of each ramp run.
fr_ca: Les rampes doivent avoir des paliers au bas et au sommet de chaque course de rampe.

source: Ramps shall have landings at the bottom and top of each ramp, points of turning, entrance, exits and at doors.
fr_ca: Les rampes doivent comporter des paliers au bas et au sommet de chaque rampe, aux points de changement de direction, aux entrées, aux sorties et aux portes.

source: Ramps that change direction between runs at landings shall have a clear landing 60 inches (1525 mm) minimum by 60 inches (1525 mm) minimum.
fr_ca: Les rampes qui changent de direction entre les volées au niveau des paliers doivent avoir un palier dégagé d'au moins 60 po [1525 mm] x 60 po [1525 mm].

source: Ramps used as part of a means of egress shall have a running slope not steeper than 1 unit vertical in 12 units horizontal (8.3-percent slope).
fr_ca: Les rampes utilisées dans le cadre d'un moyen d'évacuation doivent avoir une pente continue d'au plus 1 unité verticale sur 12 unités horizontales (pente de 8,3 %).

source: Ramps with a rise greater than 6 inches (152 mm) shall have handrails on both sides.
fr_ca: Les rampes dont la hauteur est supérieure à 6 po (152 mm) doivent être munies de mains courantes des deux côtés.

source: Ramps.
fr_ca: Rampes.

source: Receptacle outlet assemblies installed in countertops and work surfaces shall be listed for use in countertops or work surfaces.
fr_ca: Les ensembles de prises de courant installés dans les comptoirs et les surfaces de travail doivent être répertoriés pour une utilisation dans les comptoirs ou les surfaces de travail.

source: Receptacle outlet assemblies installed in countertops shall be listed for the application.
fr_ca: Les ensembles de prises de courant installés dans les comptoirs doivent être répertoriés pour l'application.

source: Receptacle outlets and operable parts of lighting controls shall be located 15 inches (380 mm) minimum and 48 inches (1220 mm) maximum above the floor.
fr_ca: Les prises de courant et les parties utilisables des commandes d’éclairage doivent être situées à au moins 15 pouces (380 mm) et à au plus 48 pouces (1 220 mm) au-dessus du plancher.

source: Receptacle outlets in floors shall not be counted as part of the required number of receptacle outlets except where located within 18 inches (457 mm) of the wall.
fr_ca: Les prises de courant dans les planchers ne doivent pas être comptées dans le nombre requis de prises de courant, sauf si elles sont situées à moins de 18 po [457 mm] du mur.

source: Receptacle outlets rendered not readily accessible by appliances fastened in place, appliance garages, sinks or range tops as addressed in the exception to Section E3901.4.1, or appliancesoccupying dedicated space shall not be considered as these required outlets.
fr_ca: Les prises de courant rendues difficilement accessibles par des appareils fixés en place, des compartiments pour appareils, des éviers ou des dessus de cuisinière, comme indiqué dans l'exception à la section E3901.4.1, ou par des appareils occupant un espace dédié, ne doivent pas être considérées comme ces prises requises.

source: Receptacle outlets required by this section shall be in addition to any receptacle that is:
fr_ca: Les prises de courant exigées par la présente section doivent s'ajouter à toute prise qui est :

source: Receptacle outlets serving a dedicated use.
fr_ca: Prises de courant desservant un usage dédié.

source: Receptacle outlets shall be permitted to be mounted not more than 12 inches (305 mm) below the countertop or work surface in construction designed for the physically impaired and for island and peninsular countertops or work surface where the surface is flat across its entire surface and there are no means to mount a receptacle within 20 inches (508 mm) above the countertop, such as in an overhead cabinet.
fr_ca: Les prises de courant peuvent être installées à au plus 12 po [305 mm] au-dessous du comptoir ou de la surface de travail dans les constructions conçues pour les personnes à mobilité réduite et pour les comptoirs ou surfaces de travail en îlot ou en péninsule où la surface est plane sur toute sa surface et où il n'y a aucun moyen d'installer une prise à moins de 20 po [508 mm] au-dessus du comptoir, comme dans une armoire suspendue.

source: Receptacles as covered in Section E4101.7.
fr_ca: Prises telles que couvertes par la Section E4101.7.

source: Receptacles installed for countertop and similar work surfaces as specified in Section E3901.4 shall not be considered as the receptacle outlets required by Section E3901.2.
fr_ca: Les prises installées pour les comptoirs et les surfaces de travail similaires, comme spécifié à l'article E3901.4, ne doivent pas être considérées comme les prises de courant exigées par l'article E3901.2.

source: Receptacles mounted below the countertop or work surface in accordance with this exception shall not be located where the countertop or work surface extends more than 6 inches (152 mm) beyond its support base.
fr_ca: Les prises de courant montées sous le comptoir ou la surface de travail conformément à cette exception ne doivent pas être situées là où le comptoir ou la surface de travail se prolonge de plus de 6 po [152 mm] au-delà de sa base de mur.

source: Recreational facilities in accordance with Section 1111.2.
fr_ca: Installations de loisirs selon la section 1111.2.

source: Refuge areas shall be provided within each smoke compartment.
fr_ca: Des aires de refuge doivent être prévues dans chaque compartiment coupe-fumée.

source: Regular, float, wired or patterned glass in jalousies and louvered windows shall be not less than nominal 3/16 inch (5 mm) thick and not more than 48 inches (1219 mm) in length.
fr_ca: Le verre ordinaire, flotté, armé ou à motifs dans les jalousies et les fenêtres à persiennes ne doit pas avoir une épaisseur nominale inférieure à 3/16 po [5 mm] ni une longueur supérieure à 48 po [1219 mm].

source: Reinforced to carry its own weight and all imposed loads.
fr_ca: Renforcée pour supporter son propre poids et toutes les charges imposées.

source: Reinforcement for the water closet side wall vertical grab bar component required by Section 604.5 is not required.
fr_ca: Le renforcement de la barre d'appui verticale de la paroi latérale de la cabine de toilette requis par la section 604.5 n'est pas requis.

source: Reinforcement is not required in a room containing only a lavatory and a water closet, provided the room does not contain the only lavatory or water closet on the accessible level of the dwelling unit.
fr_ca: Le renforcement n'est pas exigé dans une pièce ne contenant qu'un lavabo et une cabine de toilette, à condition que la pièce ne contienne pas le seul lavabo ou la seule cabine de toilette au niveau accessible de l'unité d'habitation.

source: Reinforcement is not required where Type B units are not provided in the structure.
fr_ca: Le renforcement n'est pas exigé lorsqu'il n'y a pas d'unités de type B dans la structure.

source: Reinforcement shall accommodate a swing-up grab bar with a height in the down position of 33 inches (840 mm) minimum and 36 inches (915 mm) maximum.
fr_ca: Le renforcement doit pouvoir accueillir une barre d'appui pivotante dont la hauteur en position abaissée est comprise entre 33 po [840 mm] et 36 po [915 mm].

source: Reinforcement shall accommodate a swing–up grab bar centered 153/4 inches (400 mm) from the centerline of the water closet and 28 inches (710 mm) minimum in length, measured from the wall to the end of the horizontal portion of the grab bar.
fr_ca: Le renforcement doit permettre l'installation d'une barre d'appui pivotante centrée à 153/4 po [400 mm] de la ligne d'axe de la cabine de toilette et d'une longueur minimale de 28 po [710 mm], mesurée du mur à l'extrémité de la partie horizontale de la barre d'appui.

source: Reinforcement shall be adequate to resist forces in accordance with Section 609.8.
fr_ca: Le renforcement doit être suffisant pour résister aux forces selon la section 609.8.

source: Reinforcement shall be provided for the future installation of grab bars and shower seats at water closets, bathtubs, and shower compartments.
fr_ca: Un renforcement doit être prévu pour l'installation future de barres d'appui et de sièges de douche dans les cabines de toilette, les baignoires et les cabines de douche.

source: Reinforcement shall be provided for the future installation of grab bars at water closets.
fr_ca: Des renforts doivent être prévus pour l’installation future de barres d’appui au niveau des toilettes.

source: Reinforcement shall be provided for the future installation of grab bars complying with Section 604.5 at water closets; grab bars complying with Section 607.4 at bathtubs; and for grab bars and shower seats complying with Sections 608.3, 608.2.1.3, 608.2.2.3 and 608.2.3.2 at shower compartments.
fr_ca: Il faut prévoir un renforcement pour l'installation future de barres d'appui conformes à la section 604.5 dans les cabines de toilette; de barres d'appui conformes à la section 607.4 dans les baignoires; et de barres d'appui et de sièges de douche conformes aux sections 608.3, 608.2.1.3, 608.2.2.3 et 608.2.3.2 dans les compartiments de douche.

source: Reinforcing shall conform to the requirements set forth in Table R1001.1 and Section R606.
fr_ca: Le renforcement doit être conforme aux exigences énoncées au tableau R1001.1 et à l'article R606.

source: Removable in-tub seats shall be 15 inches (380 mm) minimum and 16 inches (405 mm) maximum in depth.
fr_ca: Les sièges amovibles dans la baignoire doivent avoir une profondeur comprise entre 15 po [380 mm] et 16 po [405 mm].

source: Removable in-tub seats shall be capable of secure placement.
fr_ca: Les sièges amovibles dans la baignoire doivent pouvoir être placés de manière sécuritaire.

source: Repairs and maintenance: Minor repair work, including the replacement of lamps or the connection of approved portable electrical equipment to approved permanently installed receptacles.
fr_ca: Réparations et entretien : Travaux de réparation mineurs, y compris le remplacement de lampes ou le branchement d’équipements électriques portatifs approuvés à des prises approuvées installées en permanence.

source: Replacement of any minor part that does not alter approval of equipment or make such equipment unsafe.
fr_ca: Remplacement de toute pièce mineure qui ne modifie pas l'approbation de l'équipement ou n'affecte pas la sécurité de cet équipement.

source: Replacement of any part that does not alter its approval or make it unsafe.
fr_ca: Remplacement de toute pièce qui ne modifie pas son approbation ou n'affecte pas sa sécurité.

source: Reports of test results shall be prepared in accordance with the test method used and furnished to the building official on request.
fr_ca: Les rapports des résultats des essais doivent être préparés conformément à la méthode d'essai utilisée et fournis au responsable de la construction sur demande.

source: Required accessible elements shall be identified by the International Symbol of Accessibility at the following locations.
fr_ca: Les éléments accessibles requis doivent être identifiés par le Symbole international d'accessibilité aux endroits suivants.

source: Required glazed openings shall be permitted to open into sunroom additions or patio covers that abut a street, yard or court if in excess of 40 percent of the exterior sunroom walls are open, or are enclosed only by insect screening, and the ceiling height of the sunroom is not less than 7 feet (2134 mm).
fr_ca: Les ouvertures vitrées requises peuvent s'ouvrir dans des solariums ajoutés ou des terrasses couvertes qui sont adjacents à une rue, une cour ou un patio si plus de 40 % des murs extérieurs du solarium sont ouverts ou sont fermés uniquement par une moustiquaire, et si la hauteur de plafond du solarium n'est pas inférieure à 7 pi [2134 mm].

source: Required glazed openings shall open directly onto a street or public alley, or a yard or court located on the same lot as the building.
fr_ca: Les ouvertures vitrées requises doivent s'ouvrir directement sur une rue ou une allée publique, ou sur une cour ou un jardin situé sur le même terrain que le bâtiment.

source: Required interior exit stairways shall be separated by a distance not less than 30 feet (9144 mm) or not less than one-fourth of the length of the maximum overall diagonal dimension of the building or area to be served, whichever is less.
fr_ca: Les escaliers intérieurs menant à une issue qui sont requis doivent être séparés par une distance d’au moins 30 pieds (9 144 mm) ou d’au moins le quart de la plus grande dimension diagonale hors tout du bâtiment ou de l’aire desservie, selon la moindre de ces distances.

source: Residential Group R includes, among others, the use of a building or structure, or a portion thereof, for sleeping purposes when not classified as an Institutional Group I or when not regulated by the International Residential Code.
fr_ca: Le groupe résidentiel R comprend notamment l’utilisation d’un bâtiment ou d’une structure, ou d’une partie de ceux-ci, à des fins de couchage lorsqu’elle n’est pas classée dans le groupe institutionnel I ou lorsqu’elle n’est pas régie par l’International Residential Code.
